app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
---
  def edit
    @products = Product.find(params[:id])

SELECT "products".* FROM "products" ORDER BY created_at DESC
---
  def index
    @user = current_user
    @order_item = ProductOrder.new
    @products = Product.all.order('created_at DESC')