app/views/products/_form.html.erb

    <div class='form-group'>
      Category: <%= f.collection_select :category , Product.select('distinct(category)'), :category, :category %><br/>
---
SELECT distinct(category) FROM "products"